Revit 2026 API

# ExportFontTable Class

---

A table supporting a mapping of Revit font names to font names that will be set in the target export format.

SystemObject Autodesk.Revit.DBExportFontTable

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExportFontTable : IEnumerable<KeyValuePair<ExportFontKey, ExportFontInfo>>,
	IDisposable
```
```vb
Public Class ExportFontTable
	Implements IEnumerable(Of KeyValuePair(Of ExportFontKey, ExportFontInfo)),
	IDisposable
```
```cpp
public ref class ExportFontTable : IEnumerable<KeyValuePair<ExportFontKey^, ExportFontInfo^>>,
	IDisposable
```
```fsharp
type ExportFontTable =
    class
        interface IEnumerable<KeyValuePair<ExportFontKey, ExportFontInfo>>
        interface IDisposable
    end
```

The ExportFontTable type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExportFontTable | Constructs a new ExportFontTable with default values. |

|  | Name | Description |
| --- | --- | --- |
|  | Count | Count of the items contained in the collection. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Item | A copy of the ExportFontInfo for the font's ExportFontKey. |

|  | Name | Description |
| --- | --- | --- |
|  | Add | Inserts a (key,info) pair into Export font table. |
|  | Clear | Removes all contents stored in the table. |
|  | ContainsKey | Checks whether a font key exists in the table. |
|  | Dispose | Releases all resources used by the ExportFontTable |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetExportFontInfo | Gets a copy of the font info associated to the input font key. |
|  | GetFontTableIterator | Returns a FontTableIterator that iterates through the collection. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetKeys | Returns a collection of the keys stored in this table. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetValues | Returns a collection of the values stored in this table. |
|  | Remove | Removes the pair (key, info) by font key. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This table is structured as a mapping from ExportFontKey to ExportFontInfo members. The ExportFontKey contains the identification information for the font table: the Revit font name. The ExportFontInfo contains the font name to use in the export format.

The table can be accessed via direct iteration as a collection of KeyValuePairs, or by traversal of the stored keys obtained from GetKeys(), or via specific lookup of a key constructed externally. In all cases, the ExportFontInfo returned will be a copy of the ExportFontInfo from the table. In order to make changes to the ExportFontInfo and use those settings during export, set the modified ExportFontInfo back into the table using the same key.

#### Reference

Autodesk.Revit.DB Namespace